export default {
    title: 'สารก่อภูมิแพ้',
    table: {
        name: 'ชื่อ',
        createdAt: 'สร้างเมื่อ',
        updatedAt: 'อัปเดตเมื่อ',
        deletedAt: 'ลบเมื่อ',
    },
    messages: {
        noAllergen: 'ยังไม่มีสารก่อภูมิแพ้',
        confirmRestore: 'คุณแน่ใจหรือไม่ว่าต้องการกู้คืนสารก่อภูมิแพ้นี้?',
        confirmDelete: 'คุณแน่ใจหรือไม่ว่าต้องการลบสารก่อภูมิแพ้นี้อย่างถาวร?',
        confirmMoveToBin:
            'คุณแน่ใจหรือไม่ว่าต้องการย้ายสารก่อภูมิแพ้นี้ไปยังถังขยะ?',
    },
    errors: {
        loadFailed: 'ไม่สามารถโหลดสารก่อภูมิแพ้เพิ่มเติมได้',
        binFailed: 'ไม่สามารถย้ายสารก่อภูมิแพ้ไปยังถังขยะได้',
        restoreFailed: 'ไม่สามารถกู้คืนสารก่อภูมิแพ้ได้',
        deleteFailed: 'ไม่สามารถลบสารก่อภูมิแพ้ได้',
    },
    form: {
        title: 'เพิ่มสารก่อภูมิแพ้',
        editTitle: 'แก้ไขสารก่อภูมิแพ้: {name}',
        breadcrumbs: {
            allergens: 'สารก่อภูมิแพ้',
            create: 'บันทึก',
            edit: 'แก้ไข',
        },
        sections: { information: 'ข้อมูลสารก่อภูมิแพ้', photos: 'รูปภาพ' },
        fields: {
            name: 'ชื่อ',
            description: 'รายละเอียด',
            ingredients: 'วัตถุดิบ',
        },
        messages: {
            created: 'สร้างสารก่อภูมิแพ้เรียบร้อยแล้ว',
            edited: 'แก้ไขสารก่อภูมิแพ้เรียบร้อยแล้ว',
            generic: 'เกิดข้อผิดพลาด กรุณาตรวจสอบข้อมูลในแบบฟอร์ม',
        },
    },
};
