export default {
    title: 'เนื้อสัตว์',
    table: {
        name: 'ชื่อ',
        extraPrice: 'ราคาเพิ่ม',
        createdAt: 'บันทึกเมื่อ',
        updatedAt: 'แก้ไขเมื่อ',
        deletedAt: 'ลบเมื่อ',
    },
    messages: {
        noMeat: 'ยังไม่มีเนื้อสัตว์',
        confirmRestore: 'คุณแน่ใจหรือไม่ว่าต้องการกู้คืนเนื้อสัตว์นี้?',
        confirmDelete: 'คุณแน่ใจหรือไม่ว่าต้องการลบเนื้อสัตว์นี้อย่างถาวร?',
        confirmMoveToBin:
            'คุณแน่ใจหรือไม่ว่าต้องการย้ายเนื้อสัตว์นี้ไปยังถังขยะ?',
    },
    errors: {
        loadFailed: 'ไม่สามารถโหลดเนื้อสัตว์เพิ่มเติมได้',
        binFailed: 'ไม่สามารถย้ายเนื้อสัตว์ไปยังถังขยะได้',
        restoreFailed: 'ไม่สามารถกู้คืนเนื้อสัตว์ได้',
        deleteFailed: 'ไม่สามารถลบเนื้อสัตว์ได้',
    },
    form: {
        title: 'เพิ่มเนื้อสัตว์',
        editTitle: 'แก้ไขเนื้อสัตว์: {name}',
        breadcrumbs: {
            meats: 'เนื้อสัตว์',
            create: 'บันทึก',
            edit: 'แก้ไข',
        },
        sections: {
            information: 'ข้อมูลเนื้อสัตว์',
            photos: 'รูปภาพ',
        },
        fields: {
            name: 'ชื่อ',
            description: 'รายละเอียด',
            extraPrice: 'ราคาเพิ่ม',
        },
        messages: {
            created: 'สร้างเนื้อสัตว์เรียบร้อยแล้ว',
            edited: 'แก้ไขเนื้อสัตว์เรียบร้อยแล้ว',
            error: 'เกิดข้อผิดพลาด กรุณาตรวจสอบข้อมูลในแบบฟอร์ม',
        },
    },
    createModal: {
        title: 'สร้างตัวเลือกเนื้อสัตว์',
        description: 'กรอกข้อมูลด้านล่างเพื่อสร้างตัวเลือกเนื้อสัตว์ใหม่',
        fields: {
            name: 'ชื่อ',
            description: 'รายละเอียด',
            extraPrice: 'ราคาเพิ่มเติม',
        },
        error: 'เกิดข้อผิดพลาด โปรดตรวจสอบข้อมูลในแบบฟอร์ม',
    },
};
