export default {
    title: 'การยืนยันตัวตนแบบสองขั้นตอน',
    badge: 'รหัส',
    authenticationCode: {
        title: 'รหัสยืนยันตัวตน',
        description: 'กรอกรหัสยืนยันตัวตนที่ได้รับจากแอปยืนยันตัวตนของคุณ',
        toggleText: 'เข้าสู่ระบบด้วยรหัสกู้คืน',
    },
    recoveryCode: {
        title: 'รหัสกู้คืน',
        description:
            'โปรดยืนยันการเข้าถึงบัญชีของคุณโดยกรอกรหัสกู้คืนฉุกเฉินหนึ่งรหัส',
        placeholder: 'กรอกรหัสกู้คืน',
        toggleText: 'เข้าสู่ระบบด้วยรหัสยืนยันตัวตน',
    },
    continue: 'ดำเนินการต่อ',
    orYouCan: 'หรือคุณสามารถ',
};
